init.el

(use-package emojify
  :hook (after-init . global-emojify-mode))

(setq emojify-user-emojis '((":emacs:" . (("name" . "Emacs")
                                              ("image" . "~/.emacs.d/emoji/emacs.svg")
                                              ("style" . "github")))
                            (":lambda:" . (("name" . "Lambda")
                                              ("image" . "~/.emacs.d/emoji/lambda.jpg")
                                              ("style" . "github")))))
;; If emojify is already loaded refresh emoji data
(when (featurep 'emojify)
  (emojify-set-emoji-data))

(use-package fira-code-mode
  :custom (fira-code-mode-disabled-ligatures '("[]" "#{" "#(" "#_" "#_(" "x" "*" "**" "***" ":" "::" "www" "->" "->>" "+"))
  :hook (
         (prog-mode . prettify-symbols-mode)
         (prog-mode . fira-code-mode)
         (special-mode . prettify-symbols-mode)
         (special-mode . fira-code-mode)
         (text-mode . prettify-symbols-mode)
         ))

;; (use-package nyan-mode
;;   :hook ((special-mode . nyan-mode)
;;          (text-mode . nyan-mode)
;;          (progn-mode . nyan-mode)))

;; Make ESC quit prompts
(global-set-key (kbd "<escape>") 'keyboard-escape-quit)

(use-package general
  :after evil
  :config
  (general-create-definer efs/leader-keys
    :keymaps '(normal insert visual emacs)
    :prefix "SPC"
    :global-prefix "C-SPC")

  (efs/leader-keys
    "t"  '(:ignore t :which-key "toggles")
    "tt" '(counsel-load-theme :which-key "choose theme")
    "fde" '(lambda () (interactive) (find-file (expand-file-name "~/.emacs.default/Emacs.org")) :which-key "Emacs config")
    "k" '(lambda () (interactive) (org-babel-previous-src-block) :which-key "Previous block")
    "j" '(lambda () (interactive) (org-babel-next-src-block) :which-key "Next block")
    "ph" '(lambda () (interactive) (find-file (expand-file-name "~/Projects/Habits.org")) :which-key "Habits")
    "pi" '(lambda () (interactive) (find-file (expand-file-name "~/Projects/IMPA.org")) :which-key "IMPA")
    "pps" '(lambda () (interactive) (find-file (expand-file-name "~/Projects/ProcSel.org")) :which-key "Processo Seletivo")
    "ppp" '(lambda () (interactive) (find-file (expand-file-name "~/Projects/Programming.org")) :which-key "Programming")
    "pr" '(lambda () (interactive) (find-file (expand-file-name "~/Projects/Research.org")) :which-key "Reasearch")
    "pt" '(lambda () (interactive) (find-file (expand-file-name "~/Projects/Tasks.org")))
    "pu" '(lambda () (interactive) (find-file (expand-file-name "~/Projects/University.org")))))

(use-package evil
  :init
  (setq evil-want-keybinding nil)
  (setq evil-want-integration t)
  (setq evil-want-C-u-scroll t)
  (setq evil-want-C-i-jump nil)
  :config
  (evil-mode 1)
  (define-key evil-insert-state-map (kbd "C-g") 'evil-normal-state)
  (define-key evil-insert-state-map (kbd "C-h") 'evil-delete-backward-char-and-join)

  ;; Use visual line motions even outside of visual-line-mode buffers
  (evil-global-set-key 'motion "j" 'evil-next-visual-line)
  (evil-global-set-key 'motion "k" 'evil-previous-visual-line)

  (evil-set-initial-state 'messages-buffer-mode 'normal)
  (evil-set-initial-state 'dashboard-mode 'normal))

(use-package evil-collection
  :after evil
  :init
  (setq evil-want-keybinding nil)
  :config
  (evil-collection-init))

;;   (use-package general
;;   :config
;;   (general-evil-setup t)

;;   (general-create-definer dw/leader-key-def
;;     :keymaps '(normal insert visual emacs)
;;     :prefix "SPC"
;;     :global-prefix "C-SPC")

;;   (general-create-definer dw/ctrl-c-keys
;;     :prefix "C-c"))

(use-package command-log-mode
  :commands command-log-mode)

(use-package doom-themes
  :init (load-theme 'doom-Iosvkem t)) ;;wildavil's default -> doom-palenight

(use-package all-the-icons)

(use-package doom-modeline
  :init (doom-modeline-mode 1)
  :custom ((doom-modeline-height 10))
  :config
  (setq doom-modeline-buffer-file-name-style 'truncate-with-project)
  (setq doom-modeline--batery-status t)
  (setq doom-modeline-lsp t)
  (display-battery-mode 1))

(use-package which-key
  :defer 0
  :diminish which-key-mode
  :config
  (which-key-mode)
  (setq which-key-idle-delay 1))

(use-package ivy
  :diminish
  :bind (("C-s" . swiper)
         :map ivy-minibuffer-map
         ("TAB" . ivy-alt-done)
         ("C-l" . ivy-alt-done)
         ("C-j" . ivy-next-line)
         ("C-k" . ivy-previous-line)
         :map ivy-switch-buffer-map
         ("C-k" . ivy-previous-line)
         ("C-l" . ivy-done)
         ("C-d" . ivy-switch-buffer-kill)
         :map ivy-reverse-i-search-map
         ("C-k" . ivy-previous-line)
         ("C-d" . ivy-reverse-i-search-kill))
  :config
  (ivy-mode 1))

(use-package ivy-rich
  :after ivy
  :init
  (ivy-rich-mode 1))

(use-package counsel
  :bind (("C-M-j" . 'counsel-switch-buffer)
         ("C-c r" . 'revert-buffer)
         :map minibuffer-local-map
         ("C-r" . 'counsel-minibuffer-history))
  :custom
  (counsel-linux-app-format-function #'counsel-linux-app-format-function-name-only)
  :config
  (counsel-mode 1))

(use-package ivy-prescient
  :after counsel
  :custom
  (ivy-prescient-enable-filtering nil)
  :config
  ;; Uncomment the following line to have sorting remembered across sessions!
  (prescient-persist-mode 1)
  (ivy-prescient-mode 1))
