Emacs.org
** Helpful Help Commands

[[https://github.com/Wilfred/helpful][Helpful]] adds a lot of very helpful (get it?) information to Emacs' =describe-= command buffers.  For example, if you use =describe-function=, you will not only get the documentation about the function, you will also see the source code of the function and where it gets used in other places in the Emacs configuration.  It is very useful for figuring out how things work in Emacs.

#+begin_src emacs-lisp

  (use-package helpful
    :commands (helpful-callable helpful-variable helpful-command helpful-key)
    :custom
    (counsel-describe-function-function #'helpful-callable)
    (counsel-describe-variable-function #'helpful-variable)
    :bind
    ([remap describe-function] . counsel-describe-function)
    ([remap describe-command] . helpful-command)
    ([remap describe-variable] . counsel-describe-variable)
    ([remap describe-key] . helpful-key))

#+end_src

** Text Scaling

This is an example of using [[https://github.com/abo-abo/hydra][Hydra]] to design a transient key binding for quickly adjusting the scale of the text on screen.  We define a hydra that is bound to =C-s t s= and, once activated, =j= and =k= increase and decrease the text scale.  You can press any other key (or =f= specifically) to exit the transient key map.

#+begin_src emacs-lisp
  (use-package hydra
    :defer t)

  (defhydra hydra-text-scale (:timeout 4)
    "scale text"
    ("j" text-scale-increase "in")
    ("k" text-scale-decrease "out")
    ("f" nil "finished" :exit t))

  (efs/leader-keys
    "ts" '(hydra-text-scale/body :which-key "scale text"))
#+end_src

** PDF-tools
#+begin_src emacs-lisp
  (use-package pdf-tools
    :config
    (pdf-loader-install))
#+end_src

#+RESULTS:
: t

* Languages
** Julia

*** Major mode

#+begin_src emacs-lisp
(use-package julia-mode)
#+end_src

#+RESULTS:

#+begin_src emacs-lisp
(use-package julia-snail)
#+end_src

#+RESULTS:

#+begin_src emacs-lisp
   (setq inferior-julia-program-name "julia")
#+end_src

#+RESULTS:
: julia

#+begin_src emacs-lisp
  (package-install-file "~/.emacs.default/ob-julia-vterm.el/ob-julia-vterm.el")  
#+end_src

#+RESULTS:
: #s(package-desc ob-julia-vterm (0 2) "Babel Functions for Julia in VTerm" ((emacs (26 1)) (julia-vterm (0 10))) single nil nil ((:authors ("Shigeaki Nishina")) (:maintainer "Shigeaki Nishina") (:keywords "julia" "org" "outlines" "literate programming" "reproducible research") (:url . "https://github.com/shg/ob-julia-vterm.el")) nil)

#+begin_src emacs-lisp
(defalias 'org-babel-execute:julia 'org-babel-execute:julia-vterm)
#+end_src

#+RESULTS:
: org-babel-execute:julia
** Clojure

*** Major mode (code formatter included)
#+begin_src emacs-lisp
  (use-package clojure-mode
    :hook ((clojure-mode . subword-mode)
           (clojure-mode . paredit-mode)
           (clojure-mode . smartparens-strict-mode)
           (clojure-mode . aggressive-indent-mode)))
  ;; :hook ((paredit-mode . clojure-mode))
#+end_src

#+RESULTS:
: t

#+begin_src emacs-lisp
(setq clojure-align-forms-automatically t)
#+end_src

#+RESULTS:
: t

*** Extra font-locking
#+begin_src emacs-lisp
(use-package clojure-mode-extra-font-locking)
#+end_src

#+RESULTS:

*** Lint tools
#+begin_src emacs-lisp
  (use-package kibit-helper)
#+end_src

#+RESULTS:

#+begin_src emacs-lisp
  (use-package anakondo)
  (use-package flymake-kondor)
  (use-package flycheck-clj-kondo)
#+end_src

#+RESULTS:

* Org Mode
[[https://orgmode.org/][Org Mode]] is one of the hallmark features of Emacs.  It is a rich document editor, project planner, task and time tracker, blogging engine, and literate coding utility all wrapped up in one package.

** Better Font Faces

The =efs/org-font-setup= function configures various text faces to tweak the sizes of headings and use variable width fonts in most cases so that it looks more like we're editing a document in =org-mode=.  We switch back to fixed width (monospace) fonts for code blocks and tables so that they display correctly.

#+begin_src emacs-lisp

  (defun efs/org-font-setup ()
    ;; Replace list hyphen with dot
    (font-lock-add-keywords 'org-mode
                            '(("^ *\\([-]\\) "
                               (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))

    ;; ;; Set faces for heading levels
    ;; (dolist (face '((org-level-1 . 1.2)
    ;;                 (org-level-2 . 1.1)
    ;;                 (org-level-3 . 1.05)
    ;;                 (org-level-4 . 1.0)
    ;;                 (org-level-5 . 1.1)
    ;;                 (org-level-6 . 1.1)
    ;;                 (org-level-7 . 1.1)
    ;;                 (org-level-8 . 1.1)))
    ;;   (set-face-attribute (car face) nil :font "Cantarell" :weight 'regular :height (cdr face)))

    ;; Ensure that anything that should be fixed-pitch in Org files appears that way
    (set-face-attribute 'org-block nil    :foreground nil :inherit 'fixed-pitch)
    (set-face-attribute 'org-table nil    :inherit 'fixed-pitch)
    (set-face-attribute 'org-formula nil  :inherit 'fixed-pitch)
    (set-face-attribute 'org-code nil     :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-table nil    :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-checkbox nil  :inherit 'fixed-pitch)
    (set-face-attribute 'line-number nil :inherit 'fixed-pitch)
    (set-face-attribute 'line-number-current-line nil :inherit 'fixed-pitch)
    ;; (set-face-attribute 'org-format-latex-options nil :inherit 'fixed-pitch)
    ;; ;
    (setq org-format-latex-options (plist-put org-format-latex-options :scale 3.0)))

#+end_src

#+RESULTS:
: efs/org-font-setup
 

** Org-auto-tangle
   #+begin_src emacs-lisp
(use-package org-auto-tangle
  :load-path "site-lisp/org-auto-tangle/"    ;; this line is necessary only if you cloned the repo in your site-lisp directory 
  :defer t
  :hook (org-mode . org-auto-tangle-mode))
   #+end_src

   #+RESULTS:

** Basic Config

