Emacs.org
*** Nicer Heading Bullets 

[[https://github.com/sabof/org-bullets][org-bullets]] replaces the heading stars in =org-mode= buffers with nicer looking characters that you can control.  Another option for this is [[https://github.com/integral-dw/org-superstar-mode][org-superstar-mode]] which we may cover in a later video.

#+begin_src emacs-lisp  
  (use-package org-bullets
    :after org
    ;; :hook (org-mode . org-bullets)
    :custom
    ;; (org-superstar-remove-leading-stars t)
    (org-bullets-bullet-list '("家" "ॐ" "同" "Ø" "א" "҉ " "҈ ")))
  ;; ("֍" "ॐ" "፠" "Ø" "א" "҉" "҈")
#+end_src

#+RESULTS:


#+begin_src emacs-lisp
  (use-package org-superstar
    ;; :if (not dw/is-termux)
    :after org
    :hook (org-mode . org-superstar-mode)
    :custom
    (org-superstar-remove-leading-stars t)
    (org-superstar-headline-bullets-list '("家" "ॐ" "同" "Ø" "א" "҉ " "҈ ")))
  ;; ("◉" "○" "●" "○" "●" "○" "●")
  ;; Replace list hyphen with dot
  ;; (font-lock-add-keywords 'org-mode
  ;;                         '(("^ *\\([-]\\) "
  ;;                             (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))

  ;; Increase the size of various headings
  ;; (set-face-attribute 'org-document-title nil :font "Cantarell" :weight 'bold :height 1.3)
  ;; (dolist (face '((org-level-1 . 1.2)
  ;;                 (org-level-2 . 1.1)
  ;;                 (org-level-3 . 1.05)
  ;;                 (org-level-4 . 1.0)
  ;;                 (org-level-5 . 1.1)
  ;;                 (org-level-6 . 1.1)
  ;;                 (org-level-7 . 1.1)
  ;;                 (org-level-8 . 1.1)))
  ;;   (set-face-attribute (car face) nil :font "Cantarell" :weight 'medium :height (cdr face)))

  ;; Make sure org-indent face is available
  (require 'org-indent)

  ;; Ensure that anything that should be fixed-pitch in Org files appears that way
  (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
  (set-face-attribute 'org-table nil  :inherit 'fixed-pitch)
  (set-face-attribute 'org-formula nil  :inherit 'fixed-pitch)
  (set-face-attribute 'org-code nil   :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-indent nil :inherit '(org-hide fixed-pitch))
  (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch)

  ;; Get rid of the background on column views
  (set-face-attribute 'org-column nil :background nil)
  (set-face-attribute 'org-column-title nil :background nil)

  ;; TODO: Others to consider
  ;; '(org-document-info-keyword ((t (:inherit (shadow fixed-pitch)))))
  ;; '(org-meta-line ((t (:inherit (font-lock-comment-face fixed-pitch)))))
  ;; '(org-property-value ((t (:inherit fixed-pitch))) t)
  ;; '(org-special-keyword ((t (:inherit (font-lock-comment-face fixed-pitch)))))
  ;; '(org-table ((t (:inherit fixed-pitch :foreground "#83a598"))))
  ;; '(org-tag ((t (:inherit (shadow fixed-pitch) :weight bold :height 0.8))))
  ;; '(org-verbatim ((t (:inherit (shadow fixed-pitch))))))
#+end_src

#+RESULTS:


#+begin_src emacs-lisp
  (require 'org-bullets)
  (add-hook 'org-mode-hook (lambda () (org-bullets-mode 1)))
#+end_src


# #+begin_src emacs-lisp  
#     (use-package org-superstar
#     ;; :if (not dw/is-termux)
#     :after org
#     :hook (org-mode . org-superstar-mode)
#     :custom
#     (org-superstar-remove-leading-stars t)
#     (org-superstar-headline-bullets-list '("֍" "ॐ" "፠" "Ø" "א" "҉" "҈")))  
# #+end_src

 #+RESULTS:

*** Some (font) configs
    #+begin_src emacs-lisp
	;; Increase the size of various headings
     ;; Noto Serif CJK TC
      (set-face-attribute 'org-document-title nil :font "Bitstream Vera Serif" :weight 'bold :height 1.3)
      (dolist (face '((org-level-1 . 1.2)
		      (org-level-2 . 1.1)
		      (org-level-3 . 1.05)
		      (org-level-4 . 1.0)
		      (org-level-5 . 1.1)
		      (org-level-6 . 1.1)
		      (org-level-7 . 1.1)
		      (org-level-8 . 1.1)))
	(set-face-attribute (car face) nil :font "Bitstream Vera Serif" :weight 'medium :height (cdr face)))
      
      ;; Make sure org-indent face is available
      (require 'org-indent)
      
      ;; Ensure that anything that should be fixed-pitch in Org files appears that way
      (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
      (set-face-attribute 'org-table nil  :inherit 'fixed-pitch)
      (set-face-attribute 'org-formula nil  :inherit 'fixed-pitch)
      (set-face-attribute 'org-code nil   :inherit '(shadow fixed-pitch))
      (set-face-attribute 'org-indent nil :inherit '(org-hide fixed-pitch))
      (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
      (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
      (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
      (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch)
      
      ;; Get rid of the background on column views
      (set-face-attribute 'org-column nil :background nil)
      (set-face-attribute 'org-column-title nil :background nil)
    #+end_src

    #+RESULTS:

*** Center Org Buffers

We use [[https://github.com/joostkremers/visual-fill-column][visual-fill-column]] to center =org-mode= buffers for a more pleasing writing experience as it centers the contents of the buffer horizontally to seem more like you are editing a document.  This is really a matter of personal preference so you can remove the block below if you don't like the behavior.

#+begin_src emacs-lisp
  (defun efs/org-mode-visual-fill ()
    (setq visual-fill-column-width 100
	  visual-fill-column-center-text t)
    (visual-fill-column-mode 1))

  (use-package visual-fill-column
    :hook (org-mode . efs/org-mode-visual-fill))
#+end_src

#+RESULTS:
| org-evil--org-mode-hook-fn | org-ref-org-menu | (lambda nil (add-hook 'after-save-hook #'efs/org-babel-tangle-config)) | org-tempo-setup | org-display-inline-images | efs/org-mode-visual-fill | (lambda nil (org-bullets-mode 1)) | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes | #[0 \301\211\207 [imenu-create-index-function org-imenu-get-tree] 2] | efs/org-mode-setup | org-auto-tangle-mode | (lambda nil (display-line-numbers-mode 0)) | org-ref-setup-label-finders |

# *** Inline Images
# #+begin_src emacs-lisp
#   ;; -- Display images in org mode
#   ;; enable image mode first
#   (use-package iimage-mode
#     ;; add the org file link format to the iimage mode regex
#     :init
#     (add-to-list & 'iimage-mode-image-regex-alist
#                  (cons (concat "\\[\\[file:\\(~?" iimage-mode-image-filename-regex "\\)\\]") ))
#     ;;  add a hook so we can display images on load
#     (add-hook & 'org-mode-hook & '(lambda () (org-turn-on-iimage-in-org)))
#     ;; function to setup images for display on load
#     (defun org-turn-on-iimage-in-org ()
#       "display images in your org file"
#       (interactive)
#       (turn-on-iimage-mode)
#       (set-face-underline-p & 'org-link nil))
#     ;; function to toggle images in a org bugger
#     (defun org-toggle-iimage-in-org ()
#       "display images in your org file"
#       (interactive)
#       (if (face-underline-p & 'org-link)
#           (set-face-underline-p & 'org-link nil)
#         (set-face-underline-p & 'org-link t))
#       (call-interactively & 'iimage-mode)))

#   (define-key org-mode-map (kbd "C-S-a") & 'org-archive-subtree)
#   #+end_src

#+RESULTS:

Chosing an image's size with :width property
#+begin_example
#+ATTR_ORG: :width 100
#+end_example

#+begin_src emacs-lisp
  (setq org-image-actual-width nil)
#+end_src

#+RESULTS:

*** Specific 

** Configure Babel Languages

#+begin_src emacs-lisp
(use-package ein)
#+end_src

#+RESULTS:

#+begin_src emacs-lisp
  (add-hook 'org-babel-after-execute-hook 'org-display-inline-images)   
  (add-hook 'org-mode-hook 'org-display-inline-images)
#+end_src

#+begin_src emacs-lisp
  ;; (use-package ob-julia)
#+end_src

 - Ob-julia unofficial

#+begin_src emacs-lisp
  (add-to-list 'load-path "~/.emacs.d/ob-julia")
#+end_src

To execute or export code in =org-mode= code blocks, you'll need to set up =org-babel-load-languages= for each language you'd like to use.  [[https://orgmode.org/worg/org-contrib/babel/languages.html][This page]] documents all of the languages that you can use with =org-babel=.

#+begin_src emacs-lisp
  (with-eval-after-load 'org
    (org-babel-do-load-languages
     'org-babel-load-languages
     '((emacs-lisp . t)
       (python . t)
       (browser . t)
       (ditaa . t)
       (R . t)
       (go . t) 
       ;; (ipython . t)
       (julia-vterm . t)
       ;; (julia . t)
       (ein . t)
       (ditaa . t)
       (css . t)
       (lisp . t)
       (latex . t)
       (clojure . t)
       (clojurescript . t)))

    (push '("conf-unix" . conf-unix) org-src-lang-modes))
#+end_src

#+RESULTS:
: ((conf-unix . conf-unix) (dot . graphviz-dot) (conf-unix . conf-unix) (ein-julia . julia) (ein-r . R) (ein-R . R) (ein-python . python) (ein . python) (julia-vterm . julia) (browser . html) (C . c) (C++ . c++) (asymptote . asy) (bash . sh) (beamer . latex) (calc . fundamental) (cpp . c++) (ditaa . artist) (dot . fundamental) (elisp . emacs-lisp) (ocaml . tuareg) (screen . shell-script) (shell . sh) (sqlite . sql))

#+begin_src emacs-lisp
  (custom-set-variables
   '(ob-ein-languages
    '(("ein-python" . python)
      ("ein-R" . R)
      ("ein-r" . R)
      ("ein-julia" . julia))))
#+end_src

#+RESULTS:

*** Clojure(script)
#+begin_src emacs-lisp
  (require 'ob-clojure)
  (setq org-babel-clojure-backend 'cider)
#+end_src

