Emacs.org
** Structure Templates

Org Mode's [[https://orgmode.org/manual/Structure-Templates.html][structure templates]] feature enables you to quickly insert code blocks into your Org files in combination with =org-tempo= by typing =<= followed by the template name like =el= or =py= and then press =TAB=.  For example, to insert an empty =emacs-lisp= block below, you can type =<el= and press =TAB= to expand into such a block.

You can add more =src= block templates below by copying one of the lines and changing the two strings at the end, the first to be the template name and the second to contain the name of the language [[https://orgmode.org/worg/org-contrib/babel/languages.html][as it is known by Org Babel]].

#+begin_src emacs-lisp
  (require 'org-tempo)

  ;; System
  (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))

  ;; Scientific
  (add-to-list 'org-structure-template-alist '("py" . "src python"))
  (add-to-list 'org-structure-template-alist '("ju" . "src julia"))
  (add-to-list 'org-structure-template-alist '("cl" . "src clojure"))

  ;; Web
  (add-to-list 'org-structure-template-alist '("c4" . "src css :tangle ../css/.css :mkdirp yes"))
  (add-to-list 'org-structure-template-alist '("js" . "src js :tangle ../js/.js"))
  (add-to-list 'org-structure-template-alist '("h4" . "src html :tangle ../html/index.html :mkdirp yes"))

#+end_src

** Auto-tangle Configuration Files

This snippet adds a hook to =org-mode= buffers so that =efs/org-babel-tangle-config= gets executed each time such a buffer gets saved.  This function checks to see if the file being saved is the Emacs.org file you're looking at right now, and if so, automatically exports the configuration here to the associated output files.

#+begin_src emacs-lisp

  ;; Automatically tangle our Emacs.org config file when we save it
  (defun efs/org-babel-tangle-config ()
    (when (string-equal (file-name-directory (buffer-file-name))
                        (expand-file-name user-emacs-directory))
      ;; Dynamic scoping to the rescue
      (let ((org-confirm-babel-evaluate nil))
        (org-babel-tangle))))

  (add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'efs/org-babel-tangle-config)))

#+end_src

** Presentations
   #+begin_src emacs-lisp
     (defun dw/org-present-prepare-slide ()
       (org-overview)
       (org-show-entry)
       (org-show-children))

     (defun dw/org-present-hook ()
       (setq-local face-remapping-alist '((default (:height 1.5) variable-pitch)
					  (header-line (:height 4.5) variable-pitch)
					  (org-document-title (:height 1.75) org-document-title)
					  (org-code (:height 1.55) org-code)
					  (org-verbatim (:height 1.55) org-verbatim)
					  (org-block (:height 1.25) org-block)
					  (org-block-begin-line (:height 0.7) org-block)))
       (setq header-line-format " ")
       (org-appear-mode -1)
       (org-display-inline-images)
       (dw/org-present-prepare-slide))

     (defun dw/org-present-quit-hook ()
       (setq-local face-remapping-alist '((default variable-pitch default)))
       (setq header-line-format nil)
       (org-present-small)
       (org-remove-inline-images)
       (org-appear-mode 1))

     (defun dw/org-present-prev ()
       (interactive)
       (org-present-prev)
       (dw/org-present-prepare-slide))

     (defun dw/org-present-next ()
       (interactive)
       (org-present-next)
       (dw/org-present-prepare-slide))

     (use-package org-present
       :bind (:map org-present-mode-keymap
		   ("C-c C-j" . dw/org-present-next)
		   ("C-c C-k" . dw/org-present-prev))
       :hook ((org-present-mode . dw/org-present-hook)
	      (org-present-mode-quit . dw/org-present-quit-hook)))
   #+end_src

   #+RESULTS:
   : dw/org-present-prev

** Org-download
#+begin_src emacs-lisp
(use-package org-download)
#+end_src

#+RESULTS:

** Org-roam and Bibtex
It's a requirement for org-roam-bibtex,  org-roam, org-ref and bibtex-completion.
#+begin_src emacs-lisp
(use-package org-auto-tangle)
#+end_src

#+RESULTS:

 #+begin_src emacs-lisp
   (use-package org-roam
     :ensure t
     :custom
     (org-roam-directory "~/buddhi-roam")
     :bind (("C-c n l" . org-roam-buffer-toggle)
            ("C-c n f" . org-roam-node-find)
            ("C-c n g" . org-roam-graph)
            ("C-c n i" . org-roam-node-insert))
     :config
     (org-roam-db-autosyc-mode)
     (require 'org-roam-protocol))

   (use-package graphviz-dot-mode
     :ensure t)
 #+end_src

#+RESULTS:

#+begin_src emacs-lisp
(use-package org-ref)
#+end_src

#+RESULTS:

#+begin_src emacs-lisp
  (use-package bibtex-utils)
  (use-package company-bibtex)
  (use-package gscholar-bibtex)
#+end_src

#+RESULTS:

#+begin_src emacs-lisp
(use-package helm-bibtex)
#+end_src

#+RESULTS:

#+begin_src emacs-lisp
(use-package org-roam-bibtex)
#+end_src

#+RESULTS:

** Gantt charts

*** Dependencies
#+begin_src emacs-lisp
  ;; (use-package org-ql)
#+end_src

#+begin_src emacs-lisp
(use-package ts)
#+end_src

#+begin_src emacs-lisp
(use-package s)
#+end_src

#+begin_src emacs-lisp
(use-package dash)
#+end_src

*** Install
As it is hand-maiden: https://github.com/legalnonsense/elgantt/,

#+begin_src shell
  # cd ~/.emacs.d/lisp
  # git clone https://github.com/legalnonsense/elgantt.git
#+end_src

#+begin_src emacs-lisp
  ;; (add-to-list 'load-path (concat user-emacs-directory "lisp/elgantt/test.orgmode")) ;; Or wherever it is located
  ;; (require 'elgantt)
  ;; ;; (setq elgantt-agenda-files (concat user-emacs-directory "lisp/elgantt/test.org"))
#+end_src

#+RESULTS:
: ~/.emacs.d/lisp/elgantt/test.org

** Anaconda
   #+begin_src emacs-lisp
     (use-package conda
       :config
       (setq
        conda-env-home-directory (expand-file-name "~/.conda/")
        conda-env-subdirectory "envs")
       (custom-set-variables '(conda-anaconda-home "/opt/anaconda2/"))
       (conda-env-initialize-interactive-shells)
       (conda-env-initialize-eshell)
       (conda-env-autoactivate-mode t))
   #+end_src

   #+RESULTS:
   : t
 
* Terminals
** term-mode

=term-mode= is a built-in terminal emulator in Emacs.  Because it is written in Emacs Lisp, you can start using it immediately with very little configuration.  If you are on Linux or macOS, =term-mode= is a great choice to get started because it supports fairly complex terminal applications (=htop=, =vim=, etc) and works pretty reliably.  However, because it is written in Emacs Lisp, it can be slower than other options like =vterm=.  The speed will only be an issue if you regularly run console apps with a lot of output.

One important thing to understand is =line-mode= versus =char-mode=.  =line-mode= enables you to use normal Emacs keybindings while moving around in the terminal buffer while =char-mode= sends most of your keypresses to the underlying terminal.  While using =term-mode=, you will want to be in =char-mode= for any terminal applications that have their own keybindings.  If you're just in your usual shell, =line-mode= is sufficient and feels more integrated with Emacs.

With =evil-collection= installed, you will automatically switch to =char-mode= when you enter Evil's insert mode (press =i=).  You will automatically be switched back to =line-mode= when you enter Evil's normal mode (press =ESC=).

Run a terminal with =M-x term!=

*Useful key bindings:*

- =C-c C-p= / =C-c C-n= - go back and forward in the buffer's prompts (also =[[= and =]]= with evil-mode)
- =C-c C-k= - Enter char-mode
- =C-c C-j= - Return to line-mode
- If you have =evil-collection= installed, =term-mode= will enter char mode when you use Evil's Insert mode

#+begin_src emacs-lisp

  (use-package term
    :commands term
    :config
    (setq explicit-shell-file-name "bash") ;; Change this to zsh, etc
    ;;(setq explicit-zsh-args '())         ;; Use 'explicit-<shell>-args for shell-specific args

    ;; Match the default Bash shell prompt.  Update this if you have a custom prompt
    (setq term-prompt-regexp "^[^#$%>\n]*[#$%>] *"))

#+end_src

*** Better term-mode colors

The =eterm-256color= package enhances the output of =term-mode= to enable handling of a wider range of color codes so that many popular terminal applications look as you would expect them to.  Keep in mind that this package requires =ncurses= to be installed on your machine so that it has access to the =tic= program.  Most Linux distributions come with this program installed already so you may not have to do anything extra to use it.

#+begin_src emacs-lisp

  (use-package eterm-256color
    :hook (term-mode . eterm-256color-mode))

#+end_src

** vterm

[[https://github.com/akermu/emacs-libvterm/][vterm]] is an improved terminal emulator package which uses a compiled native module to interact with the underlying terminal applications.  This enables it to be much faster than =term-mode= and to also provide a more complete terminal emulation experience.

Make sure that you have the [[https://github.com/akermu/emacs-libvterm/#requirements][necessary dependencies]] installed before trying to use =vterm= because there is a module that will need to be compiled before you can use it successfully.

#+begin_src emacs-lisp

  (use-package vterm
    :commands vterm
    :config
    (setq term-prompt-regexp "^[^#$%>\n]*[#$%>] *")  ;; Set this to match your custom shell prompt
    ;;(setq vterm-shell "zsh")                       ;; Set this to customize the shell to launch
    (setq vterm-max-scrollback 10000))

#+end_src

** shell-mode

[[https://www.gnu.org/software/emacs/manual/html_node/emacs/Interactive-Shell.html#Interactive-Shell][shell-mode]] is a middle ground between =term-mode= and Eshell.  It is *not* a terminal emulator so more complex terminal programs will not run inside of it.  It does have much better integration with Emacs because all command input in this mode is handled by Emacs and then sent to the underlying shell once you press Enter.  This means that you can use =evil-mode='s editing motions on the command line, unlike in the terminal emulator modes above.

*Useful key bindings:*

- =C-c C-p= / =C-c C-n= - go back and forward in the buffer's prompts (also =[[= and =]]= with evil-mode)
- =M-p= / =M-n= - go back and forward in the input history
- =C-c C-u= - delete the current input string backwards up to the cursor
- =counsel-shell-history= - A searchable history of commands typed into the shell

One advantage of =shell-mode= on Windows is that it's the only way to run =cmd.exe=, PowerShell, Git Bash, etc from within Emacs.  Here's an example of how you would set up =shell-mode= to run PowerShell on Windows:

#+begin_src emacs-lisp

  (when (eq system-type 'windows-nt)
    (setq explicit-shell-file-name "powershell.exe")
    (setq explicit-powershell.exe-args '()))

#+end_src

