Emacs.org
* Animated images (gif)
#+begin_src emacs-lisp
  ;; Copyright (C) 2014 Matus Goljer <matus.goljer@gmail.com>
  ;; Package-requires: ((dash "2.5.0"))
  (defun org-inline-image--get-current-image ()
    "Return the overlay associated with the image under point."
    (car (--select (eq (overlay-get it 'org-image-overlay) t) (overlays-at (point)))))
  
  (defun org-inline-image--get (prop)
    "Return the value of property PROP for image under point."
    (let ((image (org-inline-image--get-current-image)))
      (when image
        (overlay-get image prop))))
  
  (defun org-inline-image-animate ()
    "Animate the image if it's possible."
    (interactive)
    (let ((image-props (org-inline-image--get 'display)))
      (when (image-multi-frame-p image-props)
        (image-animate image-props))))
  
  (defun org-inline-image-animate-auto ()
    (interactive)
    (when (eq 'org-mode major-mode)
      (while-no-input 
        (run-with-idle-timer 0.3 nil 'org-inline-image-animate))))
  
  (setq org-inline-image--get-current-image (byte-compile 'org-inline-image--get-current-image))
  (setq org-inline-image-animate  (byte-compile 'org-inline-image-animate ))
  (add-hook 'post-command-hook 'org-inline-image-animate-auto)
#+end_src
* Presentation setup
#+begin_src emacs-lisp
(use-package org-present)
#+end_src

#+RESULTS:

* Prerequisites 
#+begin_src emacs-lisp :tangle yes
  (use-package ein)
  (use-package esxml)
  (use-package prescient)
  (use-package company-prescient)
  (use-package xelb)
  (use-package cider)
#+end_src

#+RESULTS:

* Some general requirements left
#+begin_src emacs-lisp
  ;;  (use-package versuri)
  (use-package esxml)
  (use-package prescient)
  (use-package company-prescient)
  (use-package xelb)
  (use-package cider)
#+end_src

#+RESULTS:
: t

* Scratch Buffer
  #+begin_src emacs-lisp
(defun my-scratch-buffer ()
"Create a new scratch buffer -- \*hello-world\*"
(interactive)
  (let ((n 0)
        bufname buffer)
    (catch 'done
      (while t
        (setq bufname (concat "*hello-world"
          (if (= n 0) "" (int-to-string n))
            "*"))
        (setq n (1+ n))
        (when (not (get-buffer bufname))
          (setq buffer (get-buffer-create bufname))
          (with-current-buffer buffer
            (org-mode))
          ;; When called non-interactively, the `t` targets the other window (if it exists).
          (throw 'done (display-buffer buffer t))) ))))
  #+end_src

  #+RESULTS:
  : my-scratch-buffer

* Font Icons
=M-x all-the-icons-install-fonts=
#+begin_src emacs-lisp
#+end_src

* Periodic Tables
  #+begin_src emacs-lisp
    (use-package chembalance)
    (use-package chemtable)
  #+end_src
 
* Calendar Calfw
#+begin_src emacs-lisp
  (use-package calfw-org)
  (use-package calfw-cal)
  (use-package calfw-ical)
  (use-package calfw-gcal)
#+end_src

#+RESULTS:

* Reveal.js presentations
pt-br: 

#+begin_src emacs-lisp
  (use-package ox-reveal)
#+end_src

#+RESULTS:

#+begin_src emacs-lisp
  (use-package htmlize)
#+end_src

#+RESULTS:
 
* Emacs extension by shell scripting

#+begin_src emacs-lisp
  (defun tidy-html ()
    "Tidies the HTML content in the buffer using `tidy'"
    (interactive)
    (shell-command-on-region
     ;; beginning and end of buffer
     (point-min)
     (point-max)
     ;; command and parameters
     "tidy -i -w 120 -q"
     ;; output buffer
     (current-buffer)
     ;; replace?
     t
     ;; name of the error buffer
     "*Tidy Error Buffer*"
     ;; show error buffer?
     t))
#+end_src

#+RESULTS:
: tidy-html

* Celestial-mode-line
#+begin_src emacs-lisp
  (use-package celestial-mode-line
    :config
    (setq calendar-longitude "20.54S")
    (setq calendar-latitude "47.40W")
    (setq calendar-location-name "Franca, SP")
    (setq global-mode-string '("" celestial-mode-line-string display-time-string))
    (defvar celestial-mode-line-phase-representation-alist '((0 . "○") (1 . "☽") (2 . "●") (3 . "☾")))
    (defvar celestial-mode-line-sunrise-sunset-alist '((sunrise . "☀↑ ") (sunset . "☀↓ ")))
    (defvar celestial-mode-line-phase-representation-alist '((0 . "( )") (1 . "|)") (2 . "(o)") (3 . "|)")))
    (defvar celestial-mode-line-sunrise-sunset-alist '((sunrise . "*^") (sunset . "*v")))
    (celestial-mode-line-start-timer)
    :init
    (define-key global-map
      (kbd "µ")
      (display-message-or-buffer (message "`%s'" (eval '(solar-sunrise-sunset-string (calendar-current-date)))))))
#+end_src

#+RESULTS:
: t

#+begin_src emacs-lisp :tangle no
(eval '(solar-sunrise-sunset-string (calendar-current-date)))
#+end_src

#+RESULTS:
: Sunrise 3:55am (-03), sunset 8:37pm (-03) at Franca, SP (16:42 hrs daylight)

** Bindings for retriving data
#+begin_src emacs-lisp :tangle no
#+end_src

#+RESULTS:
: ‘Sunrise 3:55am (-03), sunset 8:37pm (-03) at Franca, SP (16:42 hrs daylight)’

#+begin_src emacs-lisp
(message "hello")
#+end_src

#+RESULTS:
: hello

‘Sunrise 3:55am (-03), sunset 8:37pm (-03) at Franca, SP (16:42 hrs daylight)’

* Load Desktop.el and other auxiliaries

#+begin_src emacs-lisp
(use-package load-relative)
#+end_src

#+RESULTS:

#+begin_src emacs-lisp
  (load-relative "./pl.el")
  (load-relative "./editing.el")
  (load-relative "./desktop.el")
#+end_src

#+RESULTS:
: t

